esrlabs/openbsw/executables/referenceApp/platforms/s32k148evb/main/src/bsp/startUp-threadx.S
    .long   DefaultISR                                      /* 194*/
    .long   DefaultISR                                      /* 195*/
    .long   DefaultISR                                      /* 196*/
    .long   DefaultISR                                      /* 197*/
    .long   DefaultISR                                      /* 198*/
    .long   DefaultISR                                      /* 199*/
    .long   DefaultISR                                      /* 200*/
    .long   DefaultISR                                      /* 201*/
    .long   DefaultISR                                      /* 202*/
    .long   DefaultISR                                      /* 203*/
    .long   DefaultISR                                      /* 204*/
    .long   DefaultISR                                      /* 205*/
    .long   DefaultISR                                      /* 206*/
    .long   DefaultISR                                      /* 207*/
    .long   DefaultISR                                      /* 208*/
    .long   DefaultISR                                      /* 209*/
    .long   DefaultISR                                      /* 210*/
    .long   DefaultISR                                      /* 211*/
    .long   DefaultISR                                      /* 212*/
    .long   DefaultISR                                      /* 213*/
    .long   DefaultISR                                      /* 214*/
    .long   DefaultISR                                      /* 215*/
    .long   DefaultISR                                      /* 216*/
    .long   DefaultISR                                      /* 217*/
    .long   DefaultISR                                      /* 218*/
    .long   DefaultISR                                      /* 219*/
    .long   DefaultISR                                      /* 220*/
    .long   DefaultISR                                      /* 221*/
    .long   DefaultISR                                      /* 222*/
    .long   DefaultISR                                      /* 223*/
    .long   DefaultISR                                      /* 224*/
    .long   DefaultISR                                      /* 225*/
    .long   DefaultISR                                      /* 226*/
    .long   DefaultISR                                      /* 227*/
    .long   DefaultISR                                      /* 228*/
    .long   DefaultISR                                      /* 229*/
    .long   DefaultISR                                      /* 230*/
    .long   DefaultISR                                      /* 231*/
    .long   DefaultISR                                      /* 232*/
    .long   DefaultISR                                      /* 233*/
    .long   DefaultISR                                      /* 234*/
    .long   DefaultISR                                      /* 235*/
    .long   DefaultISR                                      /* 236*/
    .long   DefaultISR                                      /* 237*/
    .long   DefaultISR                                      /* 238*/
    .long   DefaultISR                                      /* 239*/
    .long   DefaultISR                                      /* 240*/
    .long   DefaultISR                                      /* 241*/
    .long   DefaultISR                                      /* 242*/
    .long   DefaultISR                                      /* 243*/
    .long   DefaultISR                                      /* 244*/
    .long   DefaultISR                                      /* 245*/
    .long   DefaultISR                                      /* 246*/
    .long   DefaultISR                                      /* 247*/
    .long   DefaultISR                                      /* 248*/
    .long   DefaultISR                                      /* 249*/
    .long   DefaultISR                                      /* 250*/
    .long   DefaultISR                                      /* 251*/
    .long   DefaultISR                                      /* 252*/
    .long   DefaultISR                                      /* 253*/
    .long   DefaultISR                                      /* 254*/
    .long   0xFFFFFFFF                                      /*  Reserved for user TRIM value*/

    .size    __isr_vector, . - __isr_vector

    .section .text // , "a" // has no effect for gcc compiler
    .equ _NVIC_ICER,  0xE000E180
    .equ _NVIC_ICPR,  0xE000E280
    .equ _NVIC_VTOR,  0xE000ED08
    .equ _CPACR,      0xE000ED88
    .text
    .thumb

/* Reset Handler */

    .thumb_func
    .align 2
    .globl   Reset_Handler
    .type    Reset_Handler, %function

Reset_Handler:

    cpsid   i               /* Mask interrupts */
    ldr r0, =_NVIC_ICER    /* Disable interrupts and clear pending flags */
    ldr r1, =_NVIC_ICPR
    ldr r2, =0xFFFFFFFF
    str r2, [r0]            /* NVIC_ICER - clear enable IRQ register 0x00 */
    str r2, [r1]            /* NVIC_ICPR - clear pending IRQ register  0x00*/

    str r2, [r0,#4]!            /* NVIC_ICER - clear enable IRQ register 0x04*/
    str r2, [r1,#4]!            /* NVIC_ICPR - clear pending IRQ register 0x04*/

    str r2, [r0,#4]!            /* NVIC_ICER - clear enable IRQ register 0x08*/
    str r2, [r1,#4]!            /* NVIC_ICPR - clear pending IRQ register 0x08*/

    str r2, [r0,#4]!            /* NVIC_ICER - clear enable IRQ register 0x0c*/
    str r2, [r1,#4]!            /* NVIC_ICPR - clear pending IRQ register 0x0c*/

    str r2, [r0,#4]!            /* NVIC_ICER - clear enable IRQ register 0x10*/
    str r2, [r1,#4]!            /* NVIC_ICPR - clear pending IRQ register 0x10*/

    str r2, [r0,#4]!            /* NVIC_ICER - clear enable IRQ register 0x14*/
    str r2, [r1,#4]!            /* NVIC_ICPR - clear pending IRQ register 0x14*/

    str r2, [r0,#4]!            /* NVIC_ICER - clear enable IRQ register 0x18*/
    str r2, [r1,#4]!            /* NVIC_ICPR - clear pending IRQ register 0x18*/

